//APPCCMD  JOB ACCT,TDI,CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//******************************************************************
//*LICENSED MATERIALS - PROPERTY OF IBM
//*SOURCE FILE NAME = TDITP
//*(C) . 2004, 2006 ALL RIGHTS RESERVED
//*
//*//*DISCLOSURE RESTRICTED BY //******************************************************************
//*
//*  THIS JCL IS USED TO REGISTER THE APPC/MVS TRANSACTION
//*  FOR THE TIVOLI DIRECTORY INTEGRATOR EXPRESS COMMAND TRANSACTION.
//*
//*  YOU MUST HAVE RACF UPDATE ACCESS TO THE APPC TRANSACTION PROFILE
//*  DATA SET TO EXECUTE THIS JOB.  IF YOUR INSTALLATION HAS
//*  UTILIZED THE PROGRAM CLASS TO PROTECT THE ATBSDFMU UTILITY,
//*  THEN AN AUTHORIZED USER MUST HAVE ACCESS TO THIS UTILITY TO
//*  EXECUTE THIS JOB.
//*
//*  YOU MUST CUSTOMIZE THIS TRANSACTION, PRIOR TO SUBMITTING THIS
//*  JCL TO REGISTER THE TRANSACTION.
//*
//*  1. CUSTOMIZE THE JOB CARD TO REFLECT YOUR INSTALLATION STANDARDS.
//*
//*  2. CHANGE THE sys1.appctp TEXT TO REFLECT YOUR INSTALLATION'S
//*     APPC/MVS TRANSACTION PROFILE DATA SET.  IN MANY INSTALLATIONS,
//*     THIS MAY BE "SYS1.APPCTP".
//*
//*  3. CHANGE ?tdiexec? TO REFLECT THE TIVOLI DIRECTORY INTEGRATOR EXPRESS
//*     REXX EXEC DATA SET.  THIS DATA SET SHOULD CONTAIN
//*     TDIEXEC EXEC UTILIZED BY THE TIVOLI DIRECTORY INTEGRATOR EXPRESS.
//*
//*  4. CHANGE ?aschclass? TO REFLECT YOUR TRANSACTION SCHEDULER
//*     DEFINED CLASS
//*
//*
//*  THE FIRST TIME THIS JOB IS RUN, THE "TPDELETE" WILL FAIL, AS
//*  THE TRANSACTION DOES NOT EXIST.  THIS IS NORMAL.
//*
//*
//TPDELETE EXEC PGM=ATBSDFMU,REGION=0K
//SYSPRINT DD SYSOUT=*
//SYSSDLIB DD DSN=sys1.appctp,DISP=SHR  /*<== 2*/
//SYSSDOUT DD SYSOUT=*
//SYSIN    DD *
     TPDELETE
          TPNAME(TDICMD)
          SYSTEM
//TPADD    EXEC PGM=ATBSDFMU,REGION=0K
//SYSPRINT DD SYSOUT=*
//SYSSDLIB DD DSN=sys1.appctp,DISP=SHR
//SYSSDOUT DD SYSOUT=*
//SYSIN    DD DATA,DLM=XX
     TPADD
          TPNAME(TDICMD)
          SYSTEM
          ACTIVE(YES)
          TPSCHED_DELIMITER(##)
             TAILOR_SYSOUT(NO)
             TAILOR_ACCOUNT(NO)
             KEEP_MESSAGE_LOG(ALWAYS)
             CLASS(?aschclass?)        /*<== 4*/
             TPSCHED_TYPE(STANDARD)
             JCL_DELIMITER(END_OF_JCL)
//TDICMD     JOB 'TDICMD', MSGCLASS=R,
//            MSGLEVEL=(1,1)
//IKJEFT01 EXEC PGM=IKJEFT01,REGION=0K,PARM='%TDIEXEC'
//SYSPROC  DD DSN=?tdiexec?,DISP=SHR   /*<== 3*/
//SYSLBC   DD DISP=SHR,DSN=SYS1.BRODCAST
//SYSTSPRT DD SYSOUT=*,FREE=CLOSE
//SYSTSIN  DD DUMMY
END_OF_JCL
##
XX
