//ADITASK JOB USSYS0,'TDI for z/OS',                                    00000100
//             MSGCLASS=X,MSGLEVEL=(1,1),                               00000200
//             REGION=0M                                                00000300
//********************************************************************  00000400
//********************************************************************  00000500
//**                                                                **  00000600
//**  +----------------------------------------------------------+  **  00000700
//**  | Licensed Materials - Property of IBM                     |  **  00000800
//**  | (C) Copyright IBM Corp. 2007, 2010                       |  **  00000900
//**  | All rights reserved.                                     |  **  00001000
//**  |                                                          |  **  00001100
//**  | US Government Users Restricted Rights - Use, duplication |  **  00001200
//**  | or disclosure restricted by GSA ADP Schedule Contract    |  **  00001300
//**  | with IBM Corp.                                           |  **  00001400
//**  +----------------------------------------------------------+  **  00001500
//**                                                                **  00001600
//**     PROCEDURE:  ADITASK                                        **  00001700
//**                                                                **  00001800
//**     FUNCTION:                                                  **  00001900
//**                                                                **  00002000
//**        INVOKES iditask.sh WHICH STARTS IBM TIVOLI DIRECTORY    **  00002100
//**        INTEGRATOR SERVER IN DEAMON MODE.                       **  00002200
//**                                                                **  00002300
//**     NOTE:                                                      **  00002400
//**                                                                **  00002500
//**        ALTER THE LINE WITH THE "PARM=" STATEMENT, BY           **  00002600
//**        ENTERING THE FULL PATH AND FILE NAME OF THE STARTUP     **  00002700
//**        SCRIPT GENERATED BY THE "CONFIG.SH" SCRIPT.             **  00002800
//**                                                                **  00002900
//**        PLACE THIS JCL PROCEDURE INTO A SYSTEM PROCEDURE        **  00003000
//**        LIBRARY, SO THAT IT MAY BE INITIATED AS A SYSTEM        **  00003100
//**        STARTED TASK.                                           **  00003200
//**                                                                **  00003300
//**        FOR TESTING PURPOSES, THIS MAY BE INITIATED AS          **  00003400
//**        A STANDARD BACKGROUND JOBSTREAM.                        **  00003500
//**                                                                **  00003600
//********************************************************************  00003700
//ITDITASK   PROC                                                       00003800
//ITDITASK EXEC PGM=BPXBATCH,REGION=0K,TIME=NOLIMIT,                    00003900
// PARM='SH /usr/lpp/itdi/bin/iditask.sh -s /usr/lpp/itdi -d'           00004000
//STDOUT   DD SYSOUT=*                                                  00004100
//STDERR   DD SYSOUT=*                                                  00004200
//LOGOUT   DD SYSOUT=*                                                  00004300
//  PEND                                                                00004400
//  EXEC ITDITASK                                                       00004500
